src/test/resources/current-subscription-account.json

{
  "basicInfo": {
    "id": "2c92c0f9649cc85e0164ad3581166e53",
    "name": "0016E00000ZJaWyQAL",
    "accountNumber": "A00018226",
    "notes": null,
    "status": "Active",
    "crmId": "0016E00000ZJaWyQAL",
    "batch": "Batch1",
    "invoiceTemplateId": "2c92c0f85ecc47e5015ee7360d602757",
    "communicationProfileId": null,
    "IdentityId__c": "100001458",
    "sfContactId__c": "0036E00000RK9eLQAT",
    "CCURN__c": null,
    "NonStandardDataReason__c": null,
    "ProcessingAdvice__c": "NoAdvice",
    "CreatedRequestId__c": null,
    "salesRep": null,
    "parentId": null
  },
  "billingAndPayment": {
    "billCycleDay": 27,
    "currency": "AUD",
    "paymentTerm": "Due Upon Receipt",
    "paymentGateway": "Stripe Gateway GNM Membership AUS",
    "invoiceDeliveryPrefsPrint": false,
    "invoiceDeliveryPrefsEmail": true,
    "additionalEmailAddresses": []
  },
  "metrics": {
    "balance": 0,
    "totalInvoiceBalance": 0,
    "creditBalance": 0,
    "contractedMrr": 26
  },
  "billToContact": {
    "address1": "8Vh4rKkqPSPO8RP3IRc",
    "address2": "",
    "city": "8Vh4rKkqPSPO8RP3IRc",
    "country": "Australia",
    "county": null,
    "fax": null,
    "firstName": "8Vh4rKkqPSPO8RP3IRc",
    "homePhone": null,
    "lastName": "8Vh4rKkqPSPO8RP3IRc",
    "mobilePhone": null,
    "nickname": null,
    "otherPhone": null,
    "otherPhoneType": null,
    "personalEmail": null,
    "state": "VIC",
    "taxRegion": null,
    "workEmail": "8Vh4rKkqPSPO8RP3IRc@gu.com",
    "workPhone": null,
    "zipCode": "8VH4RKKQPSPO8RP3IRC",
    "SpecialDeliveryInstructions__c": null,
    "Title__c": "Mrs",
    "contactDescription": null
  },
  "soldToContact": {
    "address1": "8Vh4rKkqPSPO8RP3IRc",
    "address2": "",
    "city": "8Vh4rKkqPSPO8RP3IRc",
    "country": "Australia",
    "county": null,
    "fax": null,
    "firstName": "8Vh4rKkqPSPO8RP3IRc",
    "homePhone": null,
    "lastName": "8Vh4rKkqPSPO8RP3IRc",
    "mobilePhone": null,
    "nickname": null,
    "otherPhone": null,
    "otherPhoneType": null,
    "personalEmail": null,
    "state": "VIC",
    "taxRegion": null,
    "workEmail": "8Vh4rKkqPSPO8RP3IRc@gu.com",
    "workPhone": null,
    "zipCode": "8VH4RKKQPSPO8RP3IRC",
    "SpecialDeliveryInstructions__c": null,
    "Title__c": "Mrs",
    "contactDescription": null
  },
  "taxInfo": null,
  "success": true
}