src/test/resources/current-subscription.json

{
  "success": true,
  "id": "2c92c0f9649cc85e0164ad35816a6e59",
  "accountId": "2c92c0f9649cc85e0164ad3581166e53",
  "accountNumber": "A00018226",
  "accountName": "0016E00000ZJaWyQAL",
  "invoiceOwnerAccountId": "2c92c0f9649cc85e0164ad3581166e53",
  "invoiceOwnerAccountNumber": "A00018226",
  "invoiceOwnerAccountName": "0016E00000ZJaWyQAL",
  "subscriptionNumber": "A-S00045676",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2018-07-18",
  "serviceActivationDate": "2018-07-18",
  "customerAcceptanceDate": "2018-07-27",
  "subscriptionStartDate": "2018-07-18",
  "termStartDate": "2018-07-18",
  "termEndDate": "2019-07-18",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "contractedMrr": 26,
  "totalContractedValue": 304.2,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "QuoteNumber__QT": null,
  "OpportunityName__QT": null,
  "GiftSubscription__c": "No",
  "LastQSSPaymentDate__c": null,
  "TrialPeriodDays__c": null,
  "ActivationDate3__c": null,
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": "WNAVAU",
  "Suspended__c": "false",
  "CpqBundleJsonId__QT": null,
  "QuoteType__QT": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": null,
  "ActivationDate__c": null,
  "UserCancellationReason__c": null,
  "SuspensionStatus__c": "Active",
  "CardCountry__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "CancelledBy__c": null,
  "dummy__c": null,
  "PromotionCode__c": "WNAVAU",
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "ratePlans": [
    {
      "id": "2c92c0f9649cc85e0164ad3581856e5d",
      "productId": "2c92c0f858aa38af0158da325ce00b2c",
      "productName": "Guardian Weekly Zone C",
      "productSku": "SKU-00000047",
      "productRatePlanId": "2c92c0f858aa38af0158da325d2f0b3d",
      "ratePlanName": "Guardian Weekly Annual",
      "ratePlanCharges": [
        {
          "id": "2c92c0f9649cc85e0164ad35818b6e5e",
          "originalChargeId": "2c92c0f9649cc85e0164ad35818b6e5e",
          "productRatePlanChargeId": "2c92c0f858aa38af0158da325d450b3f",
          "number": "C-00049142",
          "name": "Zone C Annual",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "AUD312",
          "priceChangeOption": "UseLatestProductCatalogPricing",
          "priceIncreasePercentage": null,
          "currency": "AUD",
          "price": 312,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Annual",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2018-07-27",
          "effectiveEndDate": "2019-07-18",
          "processedThroughDate": "2018-07-27",
          "chargedThroughDate": "2019-07-27",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 26,
          "dmrc": 26,
          "tcv": 304.2,
          "dtcv": 304.2,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null
        }
      ],
      "subscriptionProductFeatures": []
    }
  ]
}